01_cases/vrfb_elec_tailor_ft_2pz_0p/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall_channel
    {
        type            patch;
        physicalType    patch;
        nFaces          2280;
        startFace       32860;
    }
    wall_porous
    {
        type            patch;
        physicalType    patch;
        nFaces          1200;
        startFace       35140;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          200;
        startFace       36340;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          200;
        startFace       36540;
    }
)

// ************************************************************************* //
